const test_questions = [
  {
    id: "q1",
    format: "string", // string | number | color
    options: ["Мужчина", "Женщина"],
    question: "Ваш пол:",
  },
  {
    id: "q2",
    format: "string", 
    options: ["До 18", "От 18 до 28", "От 29 до 35", "От 36"],
    question: "Укажите ваш возраст:",
  },
  {
    id: "q3",
    format: "string", 
    options: ["Дом", "Шалаш", "Бунгало", "Скамейка", "Хижина"],
    question: "Выберите лишнее:",
  },
  {
    id: "q4",
    format: "string", 
    options: ["62", "48", "74", "57", "60", "77"],
    question: "Продолжите числовой ряд: 18 20 24 32",
  },
  {
    id: "q5",
    format: "color", 
    options: ["#A8A8A8", "#0000A9", "#00A701", "#F60100", "#FDFF19", "#A95403", "#000000", "#850068", "#46B3AC"],
    question: "Выберите цвет, который сейчас наиболее Вам приятен:"
  },
  {
    id: "q6",
    format: "color", 
    options: ["#A8A8A8", "#0000A9", "#00A701", "#F60100", "#FDFF19", "#A95403", "#000000", "#850068", "#46B3AC"],
    question: "Отдохните пару секунд, еще раз Выберите цвет, который сейчас наиболее Вам приятен:"
  },
  {
    id: "q7",
    format: "string", 
    options: ["Вашингтон", "Лондон", "Париж", "Нью-Йорк", "Москва", "Оттава"],
    question: "Какой из городов лишний?",
  },
  {
    id: "q8",
    format: "number", 
    options: [1, 2, 3, 4],
    question: "Выберите правильную фигуру из четырёх пронумерованных.",
    img: "figures.png"
  },
  {
    id: "q9",
    format: "string", 
    options: ["Наслаждаться каждой минутой проведенного времени", "Быть устремленными мыслями в будущее", "Учитывать в ежедневной практике прошлый опыт"],
    question: "Вам привычнее и важнее:",
  },
  {
    id: "q10",
    format: "string", 
    options: ["Оно остроконечное", "Оно устойчиво", "Оно-находится в состоянии равновесия"],
    question: "Какое определение, по-Вашему, больше подходит к этому геометрическому изображению:",
    img: "diamond.png"
  },
  {
    id: "q11",
    format: "number", 
    options: [34, 36, 53, 44, 66, 42],
    question: "Вставьте подходящее число",
    img: "star.png"
  },
];
